Revit 2025 API
RebarGeometryType Enumeration
 Rebar geometry type
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 25.0.0.0 (25.0.0.0)
Syntax
public enum RebarGeometryType
Public Enumeration RebarGeometryType
public enum class RebarGeometryType
type RebarGeometryType
Members
Member name | Value | Description
ShapeBased | 0 |  Shape Driven.
FreeForm | 1 |  Free Form.
See Also
Reference
Autodesk.Revit.DB.Structure Namespace